app/views/messages/create.json.jbuilder

  json.image  @message.image
  json.created_at  @message.created_at
---
INSERT INTO `messages` (`body`, `image`, `user_id`, `group_id`, `created_at`, `updated_at`) VALUES ('', 'detailMain_pomeranian.png', 1, 1, '2018-03-02 09:27:54', '2018-03-02 09:27:54')