app/views/groups/new.html.haml

        .chat-group-form__field--right
          = f.collection_check_boxes :user_ids, User.all, :id, :name
---
SELECT `users`.* FROM `users`