app/views/shared/_side_bar.html.haml

  .chat-side__groups
    - current_user.groups.each do |group|
---
SELECT `groups`.* FROM `groups` INNER JOIN `members` ON `groups`.`id` = `members`.`group_id` WHERE `members`.`user_id` = 2