app/controllers/groups_controller.rb

INSERT INTO `groups` (`group_name`, `created_at`, `updated_at`) VALUES ('USA', '2018-02-23 09:25:22', '2018-02-23 09:25:22')
---
  def create
    @group = Group.new(group_params)
    if @group.save

UPDATE `groups` SET `group_name` = 'AMERICA', `updated_at` = '2018-02-24 06:58:00' WHERE `groups`.`id` = 1
---
  def update
    if @group.update(group_params)

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def set_group
    @group = Group.find(params[:id])